expressions = {
    #   stars   *
    r'([A-Za-zА-ЯЁа-яё0-9\(\)\[\]\{\}]+)\*([A-Za-zА-ЯЁа-яё0-9\(\)\[\]\{\}]+)':  r'\\b\1.*\2\\b',  #   'te*xt'
    r'\*([A-Za-zА-ЯЁа-яё0-9\(\)\[\]\{\}]+)':          r'\\b.*\1',                                 #   '*text'
    r'([A-Za-zА-ЯЁа-яё0-9\(\)\[\]\{\}]+)\*':          r'\1.*\\b',                                 #   'text*'
    r'(^|\s)\*($|\s)':      r'.*',                                                                #   '*'     ' * '
    #   one of the list      (a|b|c)
    r'\(((?:.*\|)*.*)\)':    r'(?:\1)',
    #   0 or 1 the of list [abc]
    r'\[((?:.*\|?)*?.*?)\]': r'(?:\1)??',
    #   one or more of the list, without order     {a|b|c}
    r'\{((?:.*\|?)*?.*?)\}': r'(?:\1)+?',
}
